In [89]:
import pandas as pd
import numpy as np
df = pd.read_csv("exercise_data.csv")
df.head() #Dirty Data

   Unnamed: 0  age  awesome_score  num_hairs       name
0           0   86       0.696960     131717   Marcelle
1           1   86       0.112051     185038    Darlene
2           2   82            NaN     173644    Matilde
3           3   88       1.062127     161278  Marchelle
4           4   81       1.414369      84891      Jessy

In [90]:
df.describe() #Dirty Data description (we can see "inf" in awesome_score column)

        Unnamed: 0           age  awesome_score      num_hairs
count  10000.00000  10000.000000    9022.000000   10000.000000
mean    4999.50000     59.153600            inf  112643.095600
std     2886.89568     24.023541            NaN   55812.533345
min        0.00000     18.000000      -1.999581     -50.000000
25%     2499.75000     38.000000      -0.964891   75664.750000
50%     4999.50000     60.000000       0.035636  117213.000000
75%     7499.25000     80.000000       1.016753  159127.250000
max     9999.00000    100.000000            inf  199998.000000

In [91]:
df.info() # 9022 values for "awesome_score" (dirty)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     10000 non-null  int64
 1   age            10000 non-null  int64
 2   awesome_score  9022 non-null   float64
 3   num_hairs      10000 non-null  int64
 4   name           9998 non-null   object
dtypes: float64(1), int64(3), object(1)
memory usage: 390.8+ KB

In [63]:
df['num_hairs'].describe() #Probably dont need cleaning since it didnt have "inf" in range, but its good practice (dirty)

count     10000.000000
mean     112643.095600
std       55812.533345
min         -50.000000
25%       75664.750000
50%      117213.000000
75%      159127.250000
max      199998.000000
Name: num_hairs, dtype: float64

In [64]:
df['awesome_score'].describe() #Need to clean because it range is "dirty" because it goes to infinity (dirty)

count    9022.000000
mean             inf
std              NaN
min        -1.999581
25%        -0.964891
50%         0.035636
75%         1.016753
max              inf
Name: awesome_score, dtype: float64

In [65]:
df['num_hairs'].unique()
df['num_hairs'].replace([np.inf, -np.inf], np.nan, inplace = True) #replace infinite values in "num_hairs" to clean it

In [66]:
df['awesome_score'].unique()
df['awesome_score'].replace([np.inf, -np.inf], np.nan, inplace = True) #replace infinite values in "awesome_score" to clean it

In [67]:
df.describe() 
#Compare with the first descriptions of "awesome_score" and "num_hairs",
#Worth noticing that count for "awesome_scores" dropped to 9012 from 9022, 
#meaning there were 10 "inf" values in this column but now its clean. (clean)

        Unnamed: 0           age  awesome_score      num_hairs
count  10000.00000  10000.000000    9012.000000   10000.000000
mean    4999.50000     59.153600       0.020502  112643.095600
std     2886.89568     24.023541       1.149271   55812.533345
min        0.00000     18.000000      -1.999581     -50.000000
25%     2499.75000     38.000000      -0.965704   75664.750000
50%     4999.50000     60.000000       0.033622  117213.000000
75%     7499.25000     80.000000       1.014523  159127.250000
max     9999.00000    100.000000       1.999713  199998.000000

In [73]:
#Cleaning 2nd File: create the reader and display the head 

merger_df = pd.read_csv("merge_exercise.csv")
merger_df.head()

   Unnamed: 0       name  num_apples
0           0      Barbe         250
1           1    Marjory         210
2           2  Cherianne         324
3           3     Juline         121
4           4  Thomasina         327

In [74]:
merger_df.describe() #Show description to check for infinite values (dirty dataset #2)

       Unnamed: 0  num_apples
count  200.000000   200.00000
mean    99.500000   511.16000
std     57.879185   297.65032
min      0.000000     3.00000
25%     49.750000   250.75000
50%     99.500000   544.50000
75%    149.250000   746.25000
max    199.000000   999.00000

In [75]:
merger_df.info() #All values are fixed at 200, no discrepancies (dirty dataset #2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  200 non-null    int64
 1   name        200 non-null    object
 2   num_apples  200 non-null    int64
dtypes: int64(2), object(1)
memory usage: 4.8+ KB

In [84]:
merger_df['num_apples'].unique() #Just for good practice "clean" the data from any infinite values
merger_df['num_apples'].replace([np.inf, -np.inf], np.nan, inplace = True) #replace infinite values

In [85]:
merger_df['Unnamed: 0'].unique()#Same for "Unnamed" column
merger_df['Unnamed: 0'].replace([np.inf, -np.inf], np.nan, inplace = True) #replace infinite values

In [86]:
merger_df.describe() #Compare with first description, in this case the data was already clean

       Unnamed: 0  num_apples
count  200.000000   200.00000
mean    99.500000   511.16000
std     57.879185   297.65032
min      0.000000     3.00000
25%     49.750000   250.75000
50%     99.500000   544.50000
75%    149.250000   746.25000
max    199.000000   999.00000

In [87]:
#After both data sets are clean, merger them together using the column they have in common "name"
print(merger_df.shape)
new_df = merger_df.merge(df, on = "name")
print(new_df.shape)
new_df.head()

(200, 3)
(779, 7)

,Unnamed: 0_x,name,num_apples,Unnamed: 0_y,age,awesome_score,num_hairs
0,0,Barbe,250,196,78,-1.448731,70631
1,0,Barbe,250,1333,73,-1.272561,128910
2,0,Barbe,250,4457,42,1.403834,78218
3,1,Marjory,210,3253,53,-0.519523,53579
4,1,Marjory,210,7722,76,NaN,132276